#Написать функцию, которая будет принимать параметры: ФИО, дата рождения и выводит информацию о возрасте в следующем формате: “Age for Фамилия Имя Отчество: 30 years”
a = str(input("Введите ФИО"))
b = int(input("День рождения"))
c = int(input("Месяц рождения"))
d = int(input("Год рождения"))
print("Общая информация:")
f = 2019 - d

def func (Age):
	ABC =  b + c + d
	return 	Age

print(func("'Age of {}: {} years'".format(a, f)))