#Написать функцию, которая будет принимать номер телефона и выводить его в формате +38 (099) 123 - 12 - 12

a = '+38'
b = '(099)'
c = '123'
d = '-'
e = '12'
f = '-'
g = "12"

def func(number):
	number = a + b + c + d + e + f + g
	return number

print(func("{} {} {} {} {} {} {}".format(a, b, c, d, e, f,g)))
